id: ec51a78b-fe00-4bc5-9b7b-2fd40b2c19e0')]
name: SeguridadSi-7-Deshabilitada auth. fuerte
description: ''
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
queryFrequency: PT5H
queryPeriod: PT5H
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics: []
query: "AuditLogs\n| extend OperationLower = tolower(OperationName)\n| where OperationLower has \"disable strong authentication\"\
  \n| project\n    TimeGenerated,\n    Identity,\n    OperationName,\n    AdditionalDetails\n| order by TimeGenerated desc\n\
  \n"
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
kind: Scheduled
version: 1.0.0
