id: 245e3c67-a777-4da2-b998-7fc22b91b945')]
name: SeguridadSi-8-Acceso portal Intune
description: ''
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
queryFrequency: PT5H
queryPeriod: PT5H
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics: []
query: "AuditLogs\n| extend AdditionalDetailsStr = tostring(AdditionalDetails)\n| where OperationName == \"UserLoggedIn\"\n\
  \    and AdditionalDetailsStr has \"9ba1a5c7-f17a-4de9-a1f1-6178c8d51223\"\n| project\n    TimeGenerated,\n    Identity,\n\
  \    OperationName,\n    AdditionalDetailsStr\n| order by TimeGenerated desc\n\n"
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
kind: Scheduled
version: 1.0.0
