id: e937fe26-2000-4cab-ba9c-1bd8ac87d778')]
name: SeguridadSi-2-Consentimiento de permisos anómales
description: ''
severity: Medium
requiredDataConnectors:
- connectorId: AzureActiveDirectory
  dataTypes:
  - AuditLogs
queryFrequency: PT5H
queryPeriod: PT5H
triggerOperator: GreaterThan
triggerThreshold: 0
suppressionDuration: PT5H
suppressionEnabled: false
tactics: []
query: "AuditLogs\n| where TimeGenerated > ago(1d)\n| where LoggedByService =~ \"Core Directory\"\n| where Category =~ \"\
  ApplicationManagement\"\n| where OperationName =~ \"Consent to application\"\n| mv-apply TargetResource = TargetResources\
  \ on (\n    where TargetResource.type =~ \"ServicePrincipal\"\n    | extend AppDisplayName = tostring(TargetResource.displayName),\n\
  \             AppClientId = tostring(TargetResource.id),\n             props = TargetResource.modifiedProperties\n)\n| where\
  \ AppClientId !in (\n    externaldata(knownAppClientId:string, knownAppDisplayName:string)\n    [@\"https://raw.githubusercontent.com/Azure/Azure-Sentinel/master/Sample%20Data/Feeds/Microsoft.OAuth.KnownApplications.csv\"\
  ]\n    with (format=\"csv\")\n)\n| mv-apply ConsentFull = props on (\n    where ConsentFull.displayName =~ \"ConsentAction.Permissions\"\
  \n)\n| parse ConsentFull with * \"ConsentType: \" GrantConsentType \", Scope: \" GrantScope1 \", CreatedDateTime\" * \"\
  ]\" *\n| where GrantConsentType != \"AllPrincipals\"\n| where ConsentFull has_any (dynamic([\"contacts.read\", \"user.read\"\
  , \"mail.read\", \"notes.read.all\", \"mailboxsettings.readwrite\", \"Files.ReadWrite.All\", \"mail.send\", \"files.read\"\
  , \"files.read.all\"]))\n| extend GrantScopeCount = countof(tolower(GrantScope1), \"contacts.read|user.read|mail.read|notes.read.all|mailboxsettings.readwrite|Files.ReadWrite.All|mail.send|files.read|files.read.all\"\
  , 'regex')\n| where GrantScopeCount > 5\n| mv-apply AdditionalDetail = AdditionalDetails on (\n    where AdditionalDetail.key\
  \ =~ \"User-Agent\"\n    | extend GrantUserAgent = AdditionalDetail.value\n)\n| join kind=leftouter (\n    AuditLogs\n \
  \   | where TimeGenerated > ago(14d)\n    | where LoggedByService =~ \"Core Directory\"\n    | where Category =~ \"ApplicationManagement\"\
  \n    | where OperationName =~ \"Add service principal\"\n    | mv-apply TargetResource = TargetResources on (\n       \
  \ where TargetResource.type =~ \"ServicePrincipal\"\n        | extend props = TargetResource.modifiedProperties,\n     \
  \            AppClientId = tostring(TargetResource.id)\n    )\n    | mv-apply Property = props on (\n        where Property.displayName\
  \ =~ \"AppAddress\" and Property.newValue has \"AddressType\"\n        | extend AppReplyURLs = trim('\"', tostring(Property.newValue))\n\
  \    )\n    | distinct AppClientId, tostring(AppReplyURLs)\n) on AppClientId\n| join kind=innerunique (\n    AuditLogs\n\
  \    | where TimeGenerated > ago(14d)\n    | where LoggedByService =~ \"Core Directory\"\n    | where Category =~ \"ApplicationManagement\"\
  \n    | where OperationName in (\"Add OAuth2PermissionGrant\", \"Add delegated permission grant\")\n    | mv-apply TargetResource\
  \ = TargetResources on (\n        where TargetResource.type =~ \"ServicePrincipal\" and array_length(TargetResource.modifiedProperties)\
  \ > 0 and isnotnull(TargetResource.displayName)\n        | extend GrantAuthentication = tostring(TargetResource.displayName)\n\
  \    )\n    | extend GrantOperation = OperationName\n    | project GrantAuthentication, GrantOperation, CorrelationId\n\
  ) on CorrelationId\n| project\n    TimeGenerated, GrantConsentType, GrantScope1, AppDisplayName, AppReplyURLs,\n    GrantUserAgent,\
  \ AppClientId, GrantAuthentication, OperationName, GrantOperation,\n    CorrelationId, ConsentFull\n\n"
eventGroupingSettings:
  aggregationKind: SingleAlert
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: PT5H
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
kind: Scheduled
version: 1.0.0
